## SQL example

In [6]:
import pandas as pd
from sqlalchemy import create_engine
import sqlalchemy
SQLALCHEMY_SILENCE_UBER_WARNING=1

df = pd.read_csv('../sql_example.csv', parse_dates=['date'])
engine = create_engine("postgresql://postgres:***@localhost/postgres")

dtype = {
    "cityname": sqlalchemy.TEXT,
    "date": sqlalchemy.DATE,
    "clientid": sqlalchemy.BIGINT,
    "orderid": sqlalchemy.BIGINT,
    "sales": sqlalchemy.BIGINT
}
df.to_sql('task', con=engine, index=False, if_exists='replace', dtype=dtype)
pd.DataFrame(engine.execute("with unique_clients as (\
	select distinct\
	cityname,\
	min(date) over\
		(partition by cityname, clientid order by date rows between 30 preceding and current row) as date,\
	clientid\
	from task\
),\
\
count_clients as (\
	select \
	cityname,\
	date,\
	count(clientid) as count_unique_clients\
	from unique_clients\
	group by 1, 2\
)\
\
select \
cityname,\
date,\
sum(count_unique_clients) over (\
	partition by cityname order by cityname, date rows between 30 preceding and current row) as active_base \
from count_clients;").fetchall())

    cityname        date active_base
0      city1  2022-01-01         512
1      city1  2022-01-02        1044
2      city1  2022-01-03        1641
3      city1  2022-01-04        2128
4      city1  2022-01-05        2597
..       ...         ...         ...
354    city2  2022-06-26        1295
355    city2  2022-06-27        1307
356    city2  2022-06-28        1314
357    city2  2022-06-29        1372
358    city2  2022-06-30        1429

[359 rows x 3 columns]